In [1]:
import numpy as np
import pandas as pd

# Series / Seriler

In [2]:
benimSozlugum = {"Atil": 50, "Zeynep": 40, "Mehmet": 30}

In [3]:
pd.Series(benimSozlugum)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [4]:
benimYaslarim = [50,40,30]
benimİsimlerim = ["Atil","Zeynep","Mehmet"]

In [7]:
pd.Series(benimYaslarim) # indexler otomatik olarak 0,1,2 şeklinde oluşur.

0    50
1    40
2    30
dtype: int64

In [6]:
pd.Series(benimYaslarim,benimİsimlerim) # indexlerimiz değişti

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [8]:
pd.Series(data=benimYaslarim,index=benimİsimlerim) # indexlerimiz değiştirildi

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [9]:
numpyDizisi = np.array([50,40,30])

In [10]:
numpyDizisi

array([50, 40, 30])

In [11]:
pd.Series(numpyDizisi)

0    50
1    40
2    30
dtype: int32

In [12]:
pd.Series(numpyDizisi,benimİsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int32

## Series özellikleri

In [13]:
pd.Series(["Atil","Atlas","Osman"])

0     Atil
1    Atlas
2    Osman
dtype: object

In [14]:
pd.Series(["Atil","Atlas","Osman"],[1,2,3])

1     Atil
2    Atlas
3    Osman
dtype: object

In [15]:
yarismaSonucu1 = pd.Series([10,5,1],["Atil","Atlas","Osman"])

In [16]:
yarismaSonucu1

Atil     10
Atlas     5
Osman     1
dtype: int64

In [17]:
yarismaSonucu2 = pd.Series([20,10,8],["Atil","Atlas","Osman"])

In [18]:
yarismaSonucu2

Atil     20
Atlas    10
Osman     8
dtype: int64

In [19]:
yarismaSonucu2["Atlas"]

10

In [20]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2

In [21]:
sonSonuc

Atil     30
Atlas    15
Osman     9
dtype: int64

# DataFrame / Veri çerçevesi

In [25]:
data = np.random.randn(4,3)

In [26]:
data

array([[-0.53688172,  0.16049658,  0.56322203],
       [-1.18033682, -2.90141278, -0.07813758],
       [-0.97481818,  1.38327336, -0.93393582],
       [-0.35159046, -0.53402841, -0.78618321]])

In [27]:
dataFrame = pd.DataFrame(data) # indexler ve columnlar otomatik olarak oluşur.

In [28]:
dataFrame

          0         1         2
0 -0.536882  0.160497  0.563222
1 -1.180337 -2.901413 -0.078138
2 -0.974818  1.383273 -0.933936
3 -0.351590 -0.534028 -0.786183

In [29]:
dataFrame[0] # 0. column

0   -0.536882
1   -1.180337
2   -0.974818
3   -0.351590
Name: 0, dtype: float64

In [30]:
yeniDataFrame = pd.DataFrame(data, index=["Atil","Zeynep","Atlas","Mehmet"], columns=["Maas","Yas","Calisma Saati"])

In [31]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.536882  0.160497       0.563222
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818  1.383273      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [32]:
yeniDataFrame["Yas"] # Yaş columnu çağırıldı.

Atil      0.160497
Zeynep   -2.901413
Atlas     1.383273
Mehmet   -0.534028
Name: Yas, dtype: float64

In [33]:
yeniDataFrame["Calisma Saati"]

Atil      0.563222
Zeynep   -0.078138
Atlas    -0.933936
Mehmet   -0.786183
Name: Calisma Saati, dtype: float64

In [34]:
yeniDataFrame[["Maas","Yas"]] # Maas ve Yaş columnları çağırıldı.

            Maas       Yas
Atil   -0.536882  0.160497
Zeynep -1.180337 -2.901413
Atlas  -0.974818  1.383273
Mehmet -0.351590 -0.534028

In [35]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.536882  0.160497       0.563222
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818  1.383273      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [36]:
yeniDataFrame.loc["Atil"] # Atil indexi çağırıldı.

Maas            -0.536882
Yas              0.160497
Calisma Saati    0.563222
Name: Atil, dtype: float64

In [37]:
yeniDataFrame.iloc[1] # Zeynep indexi çağırıldı.

Maas            -1.180337
Yas             -2.901413
Calisma Saati   -0.078138
Name: Zeynep, dtype: float64

# DataFrame İndeksler

In [38]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.536882  0.160497       0.563222
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818  1.383273      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [39]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [40]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.536882  0.160497       0.563222        0.320993
Zeynep -1.180337 -2.901413      -0.078138       -5.802826
Atlas  -0.974818  1.383273      -0.933936        2.766547
Mehmet -0.351590 -0.534028      -0.786183       -1.068057

In [42]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1) # axis=1 column, axis=0 index (row)

            Maas       Yas  Calisma Saati
Atil   -0.536882  0.160497       0.563222
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818  1.383273      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [43]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True) # inplace=True kalıcı silme

In [44]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.536882  0.160497       0.563222
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818  1.383273      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [45]:
yeniDataFrame.loc["Atil"]

Maas            -0.536882
Yas              0.160497
Calisma Saati    0.563222
Name: Atil, dtype: float64

In [46]:
yeniDataFrame.loc["Atil","Yas"]

0.16049657936473175

In [47]:
yeniDataFrame.loc["Atil"]["Yas"]

0.16049657936473175

In [48]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.536882  0.160497       0.563222
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818  1.383273      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [50]:
booleanFrame = yeniDataFrame < 0

In [51]:
booleanFrame

        Maas    Yas  Calisma Saati
Atil    True  False          False
Zeynep  True   True           True
Atlas   True  False           True
Mehmet  True   True           True

In [52]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil   -0.536882       NaN            NaN
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818       NaN      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [53]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Atil   -0.536882       NaN            NaN
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818       NaN      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [54]:
yeniDataFrame["Yas"]

Atil      0.160497
Zeynep   -2.901413
Atlas     1.383273
Mehmet   -0.534028
Name: Yas, dtype: float64

In [55]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

           Maas       Yas  Calisma Saati
Atil  -0.536882  0.160497       0.563222
Atlas -0.974818  1.383273      -0.933936

# indeks değiştirme

In [56]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.536882  0.160497       0.563222
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818  1.383273      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [57]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil -0.536882  0.160497       0.563222
1  Zeynep -1.180337 -2.901413      -0.078138
2   Atlas -0.974818  1.383273      -0.933936
3  Mehmet -0.351590 -0.534028      -0.786183

In [58]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.536882  0.160497       0.563222
Zeynep -1.180337 -2.901413      -0.078138
Atlas  -0.974818  1.383273      -0.933936
Mehmet -0.351590 -0.534028      -0.786183

In [61]:
yeniIndexListesi = ["Ati","Zey","Atl","Meh"]

In [65]:
yeniDataFrame["Yeni Indeks"] = yeniIndexListesi

In [66]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Index Yeni Indeks
Atil   -0.536882  0.160497       0.563222        Ati         Ati
Zeynep -1.180337 -2.901413      -0.078138        Zey         Zey
Atlas  -0.974818  1.383273      -0.933936        Atl         Atl
Mehmet -0.351590 -0.534028      -0.786183        Meh         Meh

In [67]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati Yeni Index
Yeni Indeks
Ati         -0.536882  0.160497       0.563222        Ati
Zey         -1.180337 -2.901413      -0.078138        Zey
Atl         -0.974818  1.383273      -0.933936        Atl
Meh         -0.351590 -0.534028      -0.786183        Meh

In [68]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Index Yeni Indeks
Atil   -0.536882  0.160497       0.563222        Ati         Ati
Zeynep -1.180337 -2.901413      -0.078138        Zey         Zey
Atlas  -0.974818  1.383273      -0.933936        Atl         Atl
Mehmet -0.351590 -0.534028      -0.786183        Meh         Meh

In [69]:
yeniDataFrame.sum() # columnların toplamı

Maas                -3.043627
Yas                 -1.891671
Calisma Saati       -1.235035
Yeni Index       AtiZeyAtlMeh
Yeni Indeks      AtiZeyAtlMeh
dtype: object

In [70]:
yeniDataFrame.max() # columnların max değeri

Maas             -0.35159
Yas              1.383273
Calisma Saati    0.563222
Yeni Index            Zey
Yeni Indeks           Zey
dtype: object

In [71]:
yeniDataFrame.mean() # ortalama

TypeError: Could not convert ['AtiZeyAtlMeh'] to numeric

# multi indeks

# columns

In [72]:
data = {
    "Name": ["Alice", "Bob","Charlie"],
    "Age": [25,30,35],
    "City": ["Amsterdam","Rotterdam","Den Haag"]
}

In [73]:
data

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 35],
 'City': ['Amsterdam', 'Rotterdam', 'Den Haag']}

In [74]:
df = pd.DataFrame(data)

In [75]:
df

      Name  Age       City
0    Alice   25  Amsterdam
1      Bob   30  Rotterdam
2  Charlie   35   Den Haag

In [76]:
columns = df.columns

In [77]:
columns

Index(['Name', 'Age', 'City'], dtype='object')

In [79]:
newColumns = ["İsim", "Yaş", "Şehir"]
df.set_axis(newColumns, axis=1)

      İsim  Yaş      Şehir
0    Alice   25  Amsterdam
1      Bob   30  Rotterdam
2  Charlie   35   Den Haag

# append

In [80]:
data1 = {'Name': ['Alice', 'Bob', 'Charlie'],
         'Age': [25, 30, 35],
         'City': ['New York', 'San Francisco', 'Los Angeles']}

In [81]:
df1 = pd.DataFrame(data1)

In [82]:
data2 = {'Name': ['David', 'Eva', 'Frank'],
         'Age': [28, 22, 40],
         'City': ['Chicago', 'Seattle', 'Miami']}

In [83]:
df2 = pd.DataFrame(data2)

In [85]:
df_combined = df1.append(df2)

AttributeError: 'DataFrame' object has no attribute 'append'